---
kind: type
id: T:Autodesk.Revit.UI.UIView
source: html/2a070256-00f0-5cab-1412-bee5bbfcfc5e.htm
---
# Autodesk.Revit.UI.UIView

A class containing data about view windows in the Revit user interface.

## Syntax (C#)
```csharp
public class UIView : IDisposable
```